{"pages":[{"title":"About Us","text":"We are two entrepreneurs from Tel Aviv who’ve been working together for almost a decade. We met in our military service while working on cyber-security projects. In 2017 we started Epsagon together, a startup that helps developers to monitor and troubleshoot their modern cloud applications. We raised over $30M from Silicon Valley investors like Lightspeed and USVP and grew an international team with an HQ in New York City and R&amp;D center in Tel Aviv. During the last five years, we experienced the startup rollercoaster through product development, go-to-market, executive hiring, fundraising, and eventually, selling Epsagon to Cisco in 2021. Today, we are product &amp; engineering leaders and Cisco, and in addition - working closely with founders in their early days, trying to help them build the next big startup company.","link":"/about/index.html"}],"posts":[{"title":"How to Start a Startup?","text":"So you want to start a startup. How do you start? Let’s cover the basic steps. Quitting your jobAssuming you are currently working somewhere, you’ll need to quit your job first. But you want to quit your job only when your startup (or startup idea) is mature enough - but how do you get to this maturity if you work a full-time job? That is a classic chicken and egg problem. From our experience, quitting your job is essential; the earlier, the better, for several reasons: As long as you continue only working evenings and weekends on your startup, you’ll be progressing very slowly, so in a way, you’re wasting your own time. Working full time isn’t just 5x more than working 2 hours a day - it’s 100x more. Having this kind of focus will make you so much more efficient. Focusing 24/7 on one problem is the only way to go. If you have co-founders, it’s a great test for their and your commitment. Quitting your job is a risk - the first risk every entrepreneur has to take early on. Not to mention that when you get to the fundraising stage, this is almost a must. Serious investors expect you to show that you are 100% committed to this startup. Finding your co-foundersEveryone talks about co-founders - that person (or people) you will spend the next 5-10 years with, and how important it is to find the right ones. But before thinking about how to find them, you should ask yourself - do I even need them? Not necessarily. Some of the most successful companies had a single founder (Jeff Bezos), so it’s a valid option. However, from our experience, having a partner (and it is a partner!) is highly beneficial, especially in the mental aspects - having someone to go through this journey with you can make all the difference. In any case, everyone seems to agree that it’s crucial to take all the time you need to find the right co-founder. Don’t rush into a decision that doesn’t sit well.","link":"/how-to-start-a-startup/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"startups","slug":"startups","link":"/tags/startups/"},{"name":"entrepreneurship","slug":"entrepreneurship","link":"/tags/entrepreneurship/"}],"categories":[]}