{"pages":[{"title":"About Us","text":"We are two entrepreneurs from Tel Aviv who’ve been working together for almost a decade. We met in our military service while working on cyber-security projects. In 2017 we started Epsagon together, a startup that helps developers to monitor and troubleshoot their modern cloud applications. We raised over $30M from Silicon Valley investors like Lightspeed and USVP and grew an international team with an HQ in New York City and R&amp;D center in Tel Aviv. During the last five years, we experienced the startup rollercoaster through product development, go-to-market, executive hiring, fundraising, and eventually, selling Epsagon to Cisco in 2021. Today, we are product &amp; engineering leaders at Cisco, and in addition - working closely with founders in their early days, trying to help them build the next big startup company.","link":"/about/index.html"}],"posts":[{"title":"How to Start a Startup?","text":"So you want to start a startup. How do you start? Let’s cover the basic steps. Quitting your jobAssuming you are currently working somewhere, you’ll need to quit your job first. But you want to quit your job only when your startup (or startup idea) is mature enough - but how do you get to this maturity if you work a full-time job? That is a classic chicken and egg problem. From our experience, quitting your job is essential; the earlier, the better, for several reasons: As long as you continue only working evenings and weekends on your startup, you’ll be progressing very slowly, so in a way, you’re wasting your own time. Working full time isn’t just 5x more than working 2 hours a day - it’s 100x more. Having this kind of focus will make you so much more efficient. Focusing 24/7 on one problem is the only way to go. If you have co-founders, it’s a great test for their and your commitment. Quitting your job is a risk - the first risk every entrepreneur has to take early on. Not to mention that when you get to the fundraising stage, this is almost a must. Serious investors expect you to show that you are 100% committed to this startup. Finding your co-foundersEveryone talks about co-founders - that person (or people) you will spend the next 5-10 years with, and how important it is to find the right ones. But before thinking about how to find them, you should ask yourself - do I even need them? Not necessarily. Some of the most successful companies had a single founder (Jeff Bezos), so it’s a valid option. However, from our experience, having a partner (and it is a partner!) is highly beneficial, especially in the mental aspects - having someone to go through this journey with you can make all the difference. Therefore, it’s essential to find a co-founder aligned with you - for example, if one of you already quit your job, the other one should too. In any case, everyone seems to agree that it’s crucial to take all the time you need to find the right co-founder. Don’t rush into a decision that doesn’t sit well. The logistics (or - legal stuff)Do you need a founder agreement? Why? How do you get one? It comes down to knowing what you know and don’t know. Get a good lawyer early, someone who knows startups and fundraising. They will help you understand what is essential at this early stage. Regarding a founder’s agreement - yes. It is possible, even expected, that sometimes one of the founders will realize early on that a startup isn’t for them. Whether the reason is financial, personal, or other, it’s essential to have a document that protects the other founder and allows them to continue building the company. IdeationSo you quit your job, have a co-founder, and now you need to start doing something. It may seem impossible, but we can offer some practical tools to find the problem that deserves to be solved. Be methodical! First of all, what is a market where you (or one of the founders) have unique expertise? A startup is complicated, so you shouldn’t add difficulty by choosing a domain you don’t understand very well. Is this a big market? Is it growing fast enough? You want to see exponential growth. If it’s growing fast, you will have the market on your side. It’s not enough, but it’s better than fighting an uphill battle. How do you know your market size? It’s important to distinguish between the domain size (“cloud spending will be $100B in 2022”) vs. your specific market (“companies are spending $10B per year on troubleshooting cloud-native applications”). The latter is far more critical as it represents what you can sell to customers. Do you have a passion for the market? People often feel they need to have a passion for something to work on it. Our experience shows that you need to be careful. As entrepreneurs, we have always had a strong passion for building great businesses, first and foremost. To do this, we needed to raise money. To do that, we needed a market where we are experts, and it is growing fast. Imagine the opposite - would you like to work on an exciting problem, only to stop working on it six months later because you couldn’t raise enough money? Of course, we are exaggerating, but we believe this is an important exercise. Don’t just start buildingDon’t spend too much time on building the actual product. Building an MVP for a B2B product with no resources (=programmers) is very difficult. It can take years. Instead, try to focus on market validation and use mockups to get customer feedback. Then, once you raise your seed round, you can run 10x faster with a kickass core engineering team. Market validationSo you put a lot of thinking and believe that you should solve a problem in a big, growing market, where you have expertise. But this is still only what you think. Now is the time to validate it with the market. This part is relatively straightforward, but most founders struggle with it, or worse - skip it. The bottom line is that you need to speak with many potential customers to validate that they have the problem you think they have, and maybe even what you’d like to build will solve it for them. Assuming you’re a B2B startup, you probably need a few dozen calls with potential customers. Anything goes to get in front of these customers. Use your connections, or reach out to high-targeted leads (such as public speakers or bloggers) via email or LinkedIn. Hassling a bit can be beneficial at this stage. Try to go beyond your network, and bring some familiar logos that the investor will quickly identify. If a cold lead takes the call with you, it proves that your initial messaging to the market works and sparks customer interest. Use “warm-cold intros”: target people you don’t know, but you know a lot about them - “Hi John, I liked your talk about microservices at the AWS conference. Can I ask you a question about it?” It’s also important to know how to ask questions. We recommend the book The Mom Test to ensure you get the most unbiased answer from the customer. For example, a great customer quote is: “we spent a lot of time trying to build an in-house solution, and it didn’t work.” The market validation is the most crucial part of a strong investor’s deck. In the deck, you should have a few slides showing customers you spoke with and highlighted quotes from customers that describe their problems. Ideally, some of these customers are referenceable, so your investor can chat with them. What’s next? Fundraising!In the following episodes, we’ll talk about raising your seed round and how to start building your company!","link":"/how-to-start-a-startup/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"startups","slug":"startups","link":"/tags/startups/"},{"name":"entrepreneurship","slug":"entrepreneurship","link":"/tags/entrepreneurship/"}],"categories":[]}