{"pages":[{"title":"About Us","text":"We are two entrepreneurs from Tel Aviv who’ve been working together for almost a decade. We met in our military service while working on cyber-security projects. In 2017 we started Epsagon together, a startup that helps developers to monitor and troubleshoot their modern cloud applications. We raised over $30M from Silicon Valley investors like Lightspeed and USVP and grew an international team with an HQ in New York City and R&amp;D center in Tel Aviv. During the last five years, we experienced the startup rollercoaster through product development, go-to-market, executive hiring, fundraising, and eventually, selling Epsagon to Cisco in 2021. Today, we are product &amp; engineering leaders at Cisco, and in addition - working closely with founders in their early days, trying to help them build the next big startup company.","link":"/about/index.html"}],"posts":[{"title":"Hiring Your First Salesperson","text":"Once you raise your Series A, it’s usually time to hire salespeople for two main reasons. The first reason is scale. The founders can’t handle a pipeline of tens or hundreds of deals alone. The second reason is expertise. Strong sales leadership brings expertise in closing deals, building the sales process, and growing a team. So you decided that you want to bring sales expertise to your startup. Who should you hire? These are the most critical factors that you should consider: Individual contributor vs. sales leader: hiring an Account Executive vs. a VP of Sales are two different paths. On the one hand, it may feel too to bring on a VP at this early stage, but on the other hand, if you hire an individual, the CEO will have to manage her directly. Therefore, unless the founder has prior sales experience, we recommend bringing a sales leader who can build the processes and the team. Deal size: if your deal size is consistently over $100K, you need an enterprise sales team. Mid-market is considered less than $100K on average, and below is SMB. Don’t bring someone not a good fit for your deal size. Domain expertise: having experience selling a similar product or solution will significantly reduce the ramp-up time and drive results quickly. If you can, try to bring someone from the same industry. Thinking about these in advance will help you grow your startup faster and reach your first millions in sales!","link":"/hiring-your-first-salesperson/"},{"title":"How to Start a Startup?","text":"So you want to start a startup. How do you start? Let’s cover the basic steps. Quitting your jobAssuming you are currently working somewhere, you’ll need to quit your job first. But you want to quit your job only when your startup (or startup idea) is mature enough - but how do you get to this maturity if you work a full-time job? That is a classic chicken and egg problem. From our experience, quitting your job is essential; the earlier, the better, for several reasons: As long as you continue only working evenings and weekends on your startup, you’ll be progressing very slowly, so in a way, you’re wasting your own time. Working full time isn’t just 5x more than working 2 hours a day - it’s 100x more. Having this kind of focus will make you so much more efficient. Focusing 24/7 on one problem is the only way to go. If you have co-founders, it’s a great test for their and your commitment. Quitting your job is a risk - the first risk every entrepreneur has to take early on. Not to mention that when you get to the fundraising stage, this is almost a must. Serious investors expect you to show that you are 100% committed to this startup. Finding your co-foundersEveryone talks about co-founders - that person (or people) you will spend the next 5-10 years with, and how important it is to find the right ones. But before thinking about how to find them, you should ask yourself - do I even need them? Not necessarily. Some of the most successful companies had a single founder (Jeff Bezos), so it’s a valid option. However, from our experience, having a partner (and it is a partner!) is highly beneficial, especially in the mental aspects - having someone to go through this journey with you can make all the difference. Therefore, it’s essential to find a co-founder aligned with you - for example, if one of you already quit your job, the other one should too. In any case, everyone seems to agree that it’s crucial to take all the time you need to find the right co-founder. Don’t rush into a decision that doesn’t sit well. The logistics (or: legal stuff)Do you need a founder agreement? Why? How do you get one? It comes down to knowing what you know and don’t know. Get a good lawyer early, someone who knows startups and fundraising. They will help you understand what is essential at this early stage. Regarding a founder’s agreement - yes. It is possible, even expected, that sometimes one of the founders will realize early on that a startup isn’t for them. Whether the reason is financial, personal, or other, it’s essential to have a document that protects the other founder and allows them to continue building the company. IdeationSo you quit your job, have a co-founder, and now you need to start doing something. It may seem impossible, but we can offer some practical tools to find the problem that deserves to be solved. Be methodical! First of all, what is a market where you (or one of the founders) have unique expertise? A startup is complicated, so you shouldn’t add difficulty by choosing a domain you don’t understand very well. Is this a big market? Is it growing fast enough? You want to see exponential growth. If it’s growing fast, you will have the market on your side. It’s not enough, but it’s better than fighting an uphill battle. How do you know your market size? It’s important to distinguish between the domain size (“cloud spending will be $100B in 2022”) vs. your specific market (“companies are spending $10B per year on troubleshooting cloud-native applications”). The latter is far more critical as it represents what you can sell to customers. Do you have a passion for the market? People often feel they need to have a passion for something to work on it. Our experience shows that you need to be careful. As entrepreneurs, we have always had a strong passion for building great businesses, first and foremost. To do this, we needed to raise money. To do that, we needed a market where we are experts, and it is growing fast. Imagine the opposite - would you like to work on an exciting problem, only to stop working on it six months later because you couldn’t raise enough money? Of course, we are exaggerating, but we believe this is an important exercise. Don’t just start buildingDon’t spend too much time on building the actual product. Building an MVP for a B2B product with no resources (=programmers) is very difficult. It can take years. Instead, try to focus on market validation and use mockups to get customer feedback. Then, once you raise your seed round, you can run 10x faster with a kickass core engineering team. Market validationSo you put a lot of thinking and believe that you should solve a problem in a big, growing market, where you have expertise. But this is still only what you think. Now is the time to validate it with the market. This part is relatively straightforward, but most founders struggle with it, or worse - skip it. The bottom line is that you need to speak with many potential customers to validate that they have the problem you think they have, and maybe even what you’d like to build will solve it for them. Assuming you’re a B2B startup, you probably need a few dozen calls with potential customers. Anything goes to get in front of these customers. Use your connections, or reach out to high-targeted leads (such as public speakers or bloggers) via email or LinkedIn. Hassling a bit can be beneficial at this stage. Try to go beyond your network, and bring some familiar logos that the investor will quickly identify. If a cold lead takes the call with you, it proves that your initial messaging to the market works and sparks customer interest. Use “warm-cold intros”: target people you don’t know, but you know a lot about them - “Hi John, I liked your talk about microservices at the AWS conference. Can I ask you a question about it?” It’s also important to know how to ask questions. We recommend the book The Mom Test to ensure you get the most unbiased answer from the customer. For example, a great customer quote is: “we spent a lot of time trying to build an in-house solution, and it didn’t work.” The market validation is the most crucial part of a strong investor’s deck. In the deck, you should have a few slides showing customers you spoke with and highlighted quotes from customers that describe their problems. Ideally, some of these customers are referenceable, so your investor can chat with them. What’s next? Fundraising!In the following episodes, we’ll talk about raising your seed round and how to start building your company!","link":"/how-to-start-a-startup/"},{"title":"Raising Your Seed - Part 1: Preparing for the Round","text":"Fundraising is one of the fundamental aspects of a startup. But unfortunately, it’s also one of the most challenging areas. So we’ll try to make it simpler here. This blog series will cover the basics of raising your seed round - from getting ready for the round to meeting investors and eventually having money in the bank. Fundraising vs. BootstrappingWhy do even you need to bring outside money? The shortest answer is because almost everything costs money: developers for building your product, travel to present at conferences, office space, and so on. These alone will probably cost hundreds of thousands of dollars for the first year. So fundraising makes sense. But there is a way not to raise money, as long as you can generate revenue to cover your expenses - this is bootstrapping. If you can start generating revenue, you can use it to cover costs and grow your business. The advantage of bootstrapping is that you’re calling the shots. You and your co-founders are the board. What’s better than that? And there are some fantastic success stories for bootstrapped companies. There are downsides to bootstrapping. The first and most important is speed. You’re operating in a fast-growing, highly competitive market. The first company to conquer the space will be the winner. The others will likely disappear. Raising capital means you can run 10x faster, which could be the difference between a winning and mediocre business. Fundraising allows you to accelerate using money. Bootstrapping also means you have more mental stress since you might need to live with zero or a minimal salary for a longer time. For these reasons, most startups choose to fundraise versus going bootstrapped. The fundraising landscapeThere are different types of investors: Angel investors are private people who usually invest anywhere from $10K to $100K, sometimes more. They often invest in groups, so the total amount is hundreds of thousands. Founders like angels because of their unique expertise and ability to help, sometimes more than their money. “Super angels” are angels that can invest anywhere from hundreds of thousands to $1M-$2M. A Venture Capital (VC) firm invests anywhere from $100K (a small or pre-seed VC) to a more prominent VC that can support anywhere from $1M up to billions in a single round. A corporate VC is an investment arm of a corporation. They aim to invest in startups for financial returns (like a regular VC) or strategic collaboration. Unfortunately, they are usually too early to bring in a seed round. The funding roundsA software B2B company typically needs anywhere from $1M to $5M to get going. The heavier the tech and the sales cycle are, the more it needs. Another way to think about these amounts is by the stage or “round” the company is at: Pre-seed stage: the goal is to verify what the startup wants to build. For that, the company usually needs $500K or less. Then, a successful milestone will be to get the initial technology working or get initial users (usually in a B2C product). Seed stage: the goal is to show initial product-market fit (PMF). In B2B, an ARR (annual recurring revenue) of a few hundreds of thousands or several paying and referencable customers is a good sign of PMF. In B2C, this could mean thousands of users or more. Being ready for the next round means you can start hiring sales and marketing people to start building the commercial operation. The seed round is usually $1M-$5M but can be even $10M in infrastructure companies that are more capital intensive. Series A: building the commercial team and proving the Go-to-Market (GTM) fit, meaning raising an additional $10M-$30M, hiring your first executive team members (e.g., VP of Sales and VP of Marketing), and a small sales team. A successful milestone would be reaching $2M-$5M of ARR. Series B, C, D, and after: from here, it’s about scaling the business to $10M, $30M, and eventually over $100M ARR. A series B usually starts at $20M and can be much more. Also, the terminology usually fades at these stages, and you’ll see very different ranges of numbers. For example, at Epsagon, we raised a $4M seed round in 2018, led by two VCs. Then we raised a $16M Series A in 2020 led by a VC, with multiple angels participating. How valuations workIf your startup’s valuation is $15M, what does it mean? It’s straightforward: the pre-money valuation is the valuation on the day of investment, and post-money is the valuation a moment after raising the round. So: post-money = pre-money + round size. How does that work with dilution? The investor’s ownership is the round size divided by the post-money valuation. So if an investor invests $3M in a company with a pre-money valuation of $12M, they get 20% of the company because three divided by 15 (12+3) is 20%. Most seed-stage VCs want significant ownership in the company, usually 10% or more, sometimes up to 30%-40%, because they know, they might not have another opportunity to invest in the company. However, more prominent VCs can invest in later stages and be more flexible. Since valuation is arbitrary and not based on revenue multipliers, it is mainly a market function and how much you raise. For example, if you ask for $1M, you might be valued at $5M, whereas $5M can make an argument that you are worth $20M. So don’t think of raising less as a way to have less dilution. Optimizing for the right thingsThere are several factors you should think about when fundraising, including: The round size The valuation The duration of the round The VC firm and the person joining your board From our experience, the most critical factor when fundraising is the person you will be working with closely during the next 5-10 years. So when deciding between different options, never choose someone, a person, or a firm that is not a good fit for you. That is always a no-go. However, you might be able to increase the valuation offered by the investor you want by having competing offers, so that’s always a good thing. Now what?In the next chapter, we will talk about how to reach out to investors, create a fundraising process, and meet investors to get the best result for your startup.Meanwhile, subscribe to our newsletter to get new blog posts in your inbox!","link":"/raising-your-seed-part-1/"},{"title":"Raising Your Seed - Part 2: The Fundraising Process","text":"In the previous blog post, we discussed preparing for the seed round - bootstrapping vs. fundraising, knowing your investors, understanding terms like valuation and dilution, and deciding what to focus on before fundraising. Now, it’s time to get to business - let’s go out there and fundraise! In this post, we’ll walk through the fundraising process, from the first meeting to having money in the bank. The basics Why is it essential to control the fundraising process? The first and most important thing to understand is that you must control the process. If you don’t own the process, it will control you, which reduces your chance for a successful seed round. When are you ready to fundraise? Ready for fundraising means you’re prepared to tell your story to the world and investors. The story should be coherent, consistent, and convincing. When you think you have the story in place, try practicing on other entrepreneurs, friendly investors, and domain experts. How long should a seed round take? Ideally, from the first investor meeting until you have a term sheet takes up to a month. However, if the process takes too long, the chances of getting a term sheet decrease significantly. Therefore, block 10-14 days for the first investor meetings. Preparing a list of potential investorsSo you think you’re ready to start fundraising, the story and deck are ready. What now? First, you need to identify your potential investors. Prepare a table with the following columns: VC name The specific person you wish to meet in the VC (usually a partner’s name) Who will introduce you to that person We recommend at least 30 names. With 30 VC names, you can expect 15 meetings. Don’t be picky at this stage. Generating a critical mass of investors is essential to take off the momentum. Decide on a timeframeThe goal is to create momentum and intensity in the fundraising process. We recommend choosing a date, i.e., October 1st, to start the fundraising process. That means you will take the first meetings only from October 1st to October 10th, with a buffer until the 14th - two weeks. You created a process: Week 1: first meetings Week 2: first meetings and follow-up meetings Week 3: follow-up meetings and, hopefully, first term-sheet Week 4: you have a signed term sheet You want to be careful not to bring in new investors too late in the process. Sometimes it will simply be too late for them, and they will drop since they wouldn’t be able to meet the timeframes you want. SchedulingIf you’re planning to meet the investors within a 10-day timeframe, you will have about three daily meetings. That might seem like not much, but don’t forget that each session is exhausting since you will pitch non-stop and highly concentrated. In addition, you will need to work on the pitch deck between the meetings. Finally, and most importantly, you will have follow-up meetings with interested VCs that will quickly stack up and create a hectic schedule. You will also have commute time if it’s not all virtual. Don’t underestimate the intensity of this process! Meeting the investorsIt’s “money time.” Come to the meeting 100% ready. If it’s a seed round, all the founders should show up. If the team is 50% of the investment decision, how can an investor decide that half or two-thirds of the team is missing? In addition, the founders should play very well together. Be careful not to show any signs of disagreements in the team in front of the investor. First investor meetings are not the time to be shy. You need the investor to understand that this is the best team he has ever seen. Don’t spare praises. Highlight the good stuff about the founders. Start with an introduction about what you do and your status: “we are company x, doing y, we’re raising $4m”, and we are currently taking first meetings.” It means there is still time for a new investor to lead the round, but since you’re already in the process, they can’t wait too long. The deckThe first thing to understand is the nature of the investor’s deck. The deck is not just presented - it is sent via email to various people in the VC firm. Therefore, everything you said in the meeting should appear in the deck, which leads us to the second point: the deck should not be short, nor should it be “clean and pretty.” Instead, the deck should be detailed and complete. Unlike a TED pitch deck that is more academy-style, the deck for the investors should be more similar to an executive summary, organized in slides. A reasonable number of slides is 15. Hidden slides are a helpful tool to come prepared for questions. When a topic is beneficial but not essential to the story, prepare a slide and make it hidden. When the investor asks, “what is your product roadmap in the first 12 months?” instead of mumbling, show a slide. It will also show the investor that you’ve thought about it and came prepared for the meeting. Should you send the deck in advance of the meeting? Our recommendation is to refuse politely. If someone is genuinely interested in learning about what you do, they should spend an hour with you to hear the story directly. On the same note, if someone only has 30 minutes to meet you, they’re probably not interested enough. After the meeting, sending the deck is common, and we recommend doing so. The structure of the deck is straightforward and contains the following part, in this order: Team: This has to come first. It doesn’t make sense to put the team in the end. The person wants to know who you are, first and foremost. Market: Convince the investor that this is a large, fast-growing market. Use examples like market data and customer stories. Be specific - the market is not just “cloud computing” but “troubleshooting tools for cloud-native applications.” When the market is well-defined, you can calculate how much companies (or consumers) are spending on these solutions today instead of throwing random numbers on the slide. The team and the market are the two most important sections. If you did a good job, the investor is excited to hear what you have to say next, and you control the conversation. Problem: What specific problem are you tackling, and why is this big and challenging (possibly technologically) one? Don’t forget the “Why Now.” If the problem has been around for five years and no one has solved it, there is a reason. (Generally, not having a “Why Now” is an excellent way to rule out potential startup ideas.) Solution: What is your approach to solving the problem? Why is it unique? Why is it defensible? Why wouldn’t Google/Amazon/other big companies do it themselves? Competition: No matter how you present your competition, it’s crucial to be aware of them and know what they do as detailed as possible. If you choose an X/Y presentation of competition, choose the axes wisely so the investor won’t lose interest. In addition, choose things fundamental to your solution (e.g., manual vs. automatic, not a specific feature). Learning about the competition is also an excellent way for the investor to learn about the market. Market Validation: Speak to 30 companies (rule of thumb) that have the problem you’re addressing and show their logos in addition to specific quotes is the best way for the investor to get conviction about your market. It also offers the founders’ capabilities to reach out to actual customers and get on a call with them. Keep in mind that ideally, 2-3 of these customers will be referenceable, i.e., willing to talk to the investor. Financials and roadmap: Some people forget that fundraising means asking for money, usually millions of dollars. It only makes sense to explain what you plan to do with this money. Show the company’s roadmap in milestones. Don’t get too specific, but show that you have a general plan. After the meetingIf the meeting went well, it wouldn’t take more than 48 hours before you get an email asking for the next steps. We don’t suggest following up proactively unless you have a term sheet, which means you have leverage that will likely trigger an investor to act. Following this process in your fundraising will significantly increase the chance of getting a term sheet!","link":"/raising-your-seed-the-fundraising-process/"},{"title":"What Is a Startup's Go-to-Market?","text":"One of the most hated questions from seed stage investors is: “What is your Go to Market?” (GTM). So what does that mean, and how can you answer it correctly? One way to think about it is the following: given money, how would you spend it to get customers? There are multiple options, such as: Zero-touch: online self-service using a credit card. Inbound or product-led: sign up for a trial or request a demo, then salespeople follow up. Enterprise sales: meet face-to-face with the customer, engage in a long proof-of-concept, and sign an enormous deal. It all starts with the persona - who is your buyer? Be specific, e.g., “Cloud Architect in a 200-person company that runs on AWS”, called the Ideal Customer Profile (ICP). The ICP is the person you will target in your outbound efforts or advertising, and once you nail the messaging to that ICP, you will start to see your pipeline growing. Demand generation is the other part of your GTM: how will you get in touch with your buyers? Some approaches may be: Write blog posts to get organic traffic Set up a booth at an industry event and engage with the audience Reach out directly to prospects via email, LinkedIn, and phone It’s almost impossible to invest heavily in all of these. If unsure, we recommend starting with the outbound approach. It gives you the most control over who you target and what you say. Check out Leslie’s Compass: A Framework for Go-to-Market Strategy for content for a thorough overview of GTM Strategy.","link":"/what-is-a-startups-go-to-market/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"startups","slug":"startups","link":"/tags/startups/"},{"name":"entrepreneurship","slug":"entrepreneurship","link":"/tags/entrepreneurship/"},{"name":"sales","slug":"sales","link":"/tags/sales/"},{"name":"leadership","slug":"leadership","link":"/tags/leadership/"},{"name":"hiring","slug":"hiring","link":"/tags/hiring/"},{"name":"gtm","slug":"gtm","link":"/tags/gtm/"},{"name":"fundraising","slug":"fundraising","link":"/tags/fundraising/"},{"name":"investors","slug":"investors","link":"/tags/investors/"},{"name":"vc","slug":"vc","link":"/tags/vc/"}],"categories":[]}